/*
6.27
A.
    0x08A4 0x08A5 0x08A6 0x08A7
    0x0704 0x0705 0x0706 0x0707
B.
    0x1238 0x1239 0x123A 0x123B
*/

/*
6.31
A.
    0 0 1 1 1 0 0 0 1 1 0 1 0
B.
    0x2
    0x6
    0x38
    否
    -
*/

/*
6.35

dst数组：
        列0     列1     列2     列3
行0     m       h       h       h
行1     m       h       h       h
行2     m       h       h       h
行3     m       h       h       h

src数组：
        列0     列1     列2     列3
行0     m       h       h       h
行1     m       h       h       h
行2     m       h       h       h
行3     m       h       h       h
*/

/*
6.39
A.  4096
B. 1024
C. 25%
*/
/*
6.43    100%
*/